src/Documents/Scan_ЗаявкаНаКомплектующие/Scan_ЗаявкаНаКомплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаНаКомплектующие</name>
  <comment>Заявка на комплектующие (scania)</comment>
  <basedOn>Document.Scan_ЗаявкаНаКомплектующие</basedOn>
  <registerRecords>AccumulationRegister.Scan_ДвиженияКомплектующих</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Scan_СтатусыЗаявокНаКомплектующие</types>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаКомплектующие</types>
    </type>
  </attributes>
  <attributes>
    <name>NumDocExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправитьВ1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>КодНеисправнойДетали</name>
      <type>
        <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующие</name>
      <type>
        <types>CatalogRef.Scan_Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТребуемое</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоступления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоРасхождение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_ПоступлениеКомплектующих/Scan_ПоступлениеКомплектующих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ПоступлениеКомплектующих</name>
  <comment>Поступление комплектующих (scania)</comment>
  <basedOn>Document.Scan_ЗаявкаНаКомплектующие</basedOn>
  <registerRecords>AccumulationRegister.Scan_ДвиженияКомплектующих</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗаявкаНаКомплектующие</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>КодНеисправнойДетали</name>
      <type>
        <types>CatalogRef.Scan_КодыНеисправныхДеталей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующие</name>
      <type>
        <types>CatalogRef.Scan_Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_ЗаявкаНаКомплектующие/Forms/ФормаВводНакладной/Module.bsl
//rarus tenkam 04.11.2017 mantis 11952 +++
&НаСервере
Функция СоздатьЗаписатьДокумент()
	ДокПоступлениеКомплектующих = Документы.Scan_ПоступлениеКомплектующих.СоздатьДокумент(); 
	ДокПоступлениеКомплектующих.Дата = ТекущаяДата(); 
	ДокПоступлениеКомплектующих.Заполнить(ДокументОснование); 
	ДокПоступлениеКомплектующих.НомерВходящегоДокумента = НомерВходящегоДокумента;
	ДокПоступлениеКомплектующих.ДатаВходящегоДокумента = ДатаВходящегоДокумента;
	
	Если ИсполненаПолностью Тогда
		Попытка
			ДокПоступлениеКомплектующих.Записать(РежимЗаписиДокумента.Проведение);	
			Возврат ДокПоступлениеКомплектующих.Ссылка;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	ВсеОк = Истина;
	Если НЕ ЗначениеЗаполнено(НомерВходящегоДокумента) Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Не заполнен номер входящего документа!");
		Сообщить(НСтр("ru = 'Не заполнен номер входящего документа!'; en = 'Please enter the number of the incoming document!'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---  	
		ВсеОк = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаВходящегоДокумента) Тогда
		//rarus FominskiyAS 24.04.2019  mantis 14191 +++
		//Сообщить("Не заполнена дата входящего документа!");
		Сообщить(НСтр("ru = 'Не заполнена дата входящего документа!'; en = 'Please enter the date of the incoming document!'"));
		//rarus FominskiyAS 24.04.2019  mantis 14191 ---   
		ВсеОк = Ложь;
	КонецЕсли;

	Если ВсеОк Тогда     		
		Если НЕ ИсполненаПолностью Тогда			
			ПараметрыФормы = Новый Структура("Основание", ДокументОснование);
			ПараметрыФормы.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
			ПараметрыФормы.Вставить("ДатаВходящегоДокумента", ДатаВходящегоДокумента);
			ПараметрыФормы.Вставить("ЗаполнитьПоОснованию", Истина);
			ОткрытьФорму("Документ.Scan_ПоступлениеКомплектующих.Форма.ФормаДокумента", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.Независимый);
			Закрыть(Неопределено);	
		Иначе
			ДокСсылка = СоздатьЗаписатьДокумент();
			Закрыть(ДокСсылка);
		КонецЕсли;   		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсполненаПолностью = Параметры.ИсполненаПолностью; 
	ДокументОснование = Параметры.ДокументОснование;
КонецПроцедуры
//rarus tenkam 04.11.2017 mantis 11952 ---
